
<a href="https://colab.research.google.com/github/Argentan/DMA_LAB2/blob/master/tutoriales/03_manejo_de_datos-pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Libreria Pandas

Pandas es la libreria mas utilizada para la manipulación de datos, utiliza series y dataframes que son estrtucturas de datos columnares, de una o dos dimensiones

In [1]:
import pandas as pd

## Series

Son columnas de datos con indices

In [2]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
animales = ['Tortuga', 'Zorro', 'Paloma', 'Elefante', "Zorro"]
tipo = ['reptil', 'mamífero', 'ave', 'mamífero', 'mamífero' ]
obj = pd.Series(tipo, index=animales)
obj

Tortuga       reptil
Zorro       mamífero
Paloma           ave
Elefante    mamífero
Zorro       mamífero
dtype: object

In [4]:
animales = ['Tortuga', 'Zorro', 'Paloma', 'Elefante', "Zorro"]
tipo = ['reptil', 'mamífero', 'ave', 'mamífero', 'mamífero' ]
obj = pd.Series(tipo)
obj.index = animales
obj

Tortuga       reptil
Zorro       mamífero
Paloma           ave
Elefante    mamífero
Zorro       mamífero
dtype: object

In [5]:
obj["Tortuga"]

'reptil'

In [6]:
obj[0]

'reptil'

In [7]:
obj.sort_values()[0]

'ave'

In [8]:
obj.sort_values()["Tortuga"]

'reptil'

## DataFrames

Son estructuras de dos dimensiones, pueden pensarse como la contatenación horizontal de series.

In [9]:
d = {'tipo_vivienda': ['casa', 'departamento'],
     'm2': [125, 59],
     'Barrio': ['San Martin', 'Florida'],
     'Precio (kUSD)': [200, 130]
    }
df = pd.DataFrame(data=d, index=["casa1", "casa2"])
df

      tipo_vivienda   m2      Barrio  Precio (kUSD)
casa1          casa  125  San Martin            200
casa2  departamento   59     Florida            130

## Lectura de archivos de datos


Pandas soporta la lectura de una amplia cantidad de formatos ([más info](http://pandas.pydata.org/pandas-docs/stable/io.html)): 

- read_csv
- read_excel
- read_hdf
- read_sql
- read_json
- read_msgpack (experimental)
- read_html
- read_gbq (experimental)
- read_stata
- read_sas
- read_clipboard
- read_pickle

Vamos a empezar a probar con una dataset publicado para una competencia de kaggle: [Titanic: Machine Learning from Disaster](https://www.kaggle.com/c/titanic/data).

In [10]:
data = pd.read_csv("https://raw.githubusercontent.com/Argentan/DMA_LAB2/master/data/titanic.csv", index_col="PassengerId")

In [11]:
data.head()

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S

[5 rows x 11 columns]

In [12]:
data.tail()

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
887                 0       2  ...   NaN        S
888                 1       1  ...   B42        S
889                 0       3  ...   NaN        S
890                 1       1  ...  C148        C
891                 0       3  ...   NaN        Q

[5 rows x 11 columns]

In [13]:
data.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [14]:
data.dtypes

Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [16]:
data.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [17]:
data.shape

(891, 11)

In [18]:
data.size

9801

In [19]:
data.Pclass

PassengerId
1      3
2      1
3      3
4      1
5      3
      ..
887    2
888    1
889    3
890    1
891    3
Name: Pclass, Length: 891, dtype: int64

In [20]:
data.Pclass.unique()

array([3, 1, 2])

In [21]:
data.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [22]:
data.Pclass.nunique()

3

## Tipos de Indexado

Hay varias formas de seleccionar un subconjunto de los datos:

- Como las listas o arrays, por posición.
- Como los diccionarios, por llave o etiqueta.
- Como los arrays, por máscaras de verdadero o falso.
- Se puede indexar por número, rango o lista (array)
- Todos estos métodos pueden funcionar subconjunto como en las columnas


## Reglas Básicas

1. Se usan corchetes (abreviatura para el método `__getitem__`) para seleccionar columnas de un `DataFrame`

    ```python
    >>> df[['a', 'b', 'c']]
    ```

2. Se usa `.iloc` para indexar por posición (tanto filas como columnas)

    ```python
    >>> df.iloc[[1, 3], [0, 2]]
    ```
    
3. Se usa `.loc` para indexar por etiquetas (tanto filas como columnas)

    ```python
    >>> df.loc[["elemento1", "elemento2", "elemento3"], ["columna1", "columna2"]]
    ```

In [23]:
data.__getitem__("Name") == data["Name"]

PassengerId
1      True
2      True
3      True
4      True
5      True
       ...
887    True
888    True
889    True
890    True
891    True
Name: Name, Length: 891, dtype: bool

In [24]:
data["Name"]

PassengerId
1                                Braund, Mr. Owen Harris
2      Cumings, Mrs. John Bradley (Florence Briggs Th...
3                                 Heikkinen, Miss. Laina
4           Futrelle, Mrs. Jacques Heath (Lily May Peel)
5                               Allen, Mr. William Henry
                             ...
887                                Montvila, Rev. Juozas
888                         Graham, Miss. Margaret Edith
889             Johnston, Miss. Catherine Helen "Carrie"
890                                Behr, Mr. Karl Howell
891                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [25]:
data.loc[[1], ["Name", "Sex"]]

                                Name   Sex
PassengerId
1            Braund, Mr. Owen Harris  male

In [26]:
data.loc[[1, 2, 3]]

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S

[3 rows x 11 columns]

In [27]:
data.loc[[1, 2, 3], "Name"]

PassengerId
1                              Braund, Mr. Owen Harris
2    Cumings, Mrs. John Bradley (Florence Briggs Th...
3                               Heikkinen, Miss. Laina
Name: Name, dtype: object

In [28]:
data.loc[1, "Survived"]

0

In [29]:
temp = data.loc[:, ["Name", "Sex"]]
temp.loc[1, "Name"] = "Rafa"
temp

                                                          Name     Sex
PassengerId
1                                                         Rafa    male
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  female
3                                       Heikkinen, Miss. Laina  female
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
5                                     Allen, Mr. William Henry    male
...                                                        ...     ...
887                                      Montvila, Rev. Juozas    male
888                               Graham, Miss. Margaret Edith  female
889                   Johnston, Miss. Catherine Helen "Carrie"  female
890                                      Behr, Mr. Karl Howell    male
891                                        Dooley, Mr. Patrick    male

[891 rows x 2 columns]

In [30]:
data.loc[1, "Name"], temp.loc[1, "Name"]

('Braund, Mr. Owen Harris', 'Rafa')

In [31]:
temp = data.copy()
temp.index = ["pasajero_nro_" + str(i) for i in temp.index]
temp.index.name =data.index.name
temp

                  Survived  Pclass  ... Cabin Embarked
PassengerId                         ...
pasajero_nro_1           0       3  ...   NaN        S
pasajero_nro_2           1       1  ...   C85        C
pasajero_nro_3           1       3  ...   NaN        S
pasajero_nro_4           1       1  ...  C123        S
pasajero_nro_5           0       3  ...   NaN        S
...                    ...     ...  ...   ...      ...
pasajero_nro_887         0       2  ...   NaN        S
pasajero_nro_888         1       1  ...   B42        S
pasajero_nro_889         0       3  ...   NaN        S
pasajero_nro_890         1       1  ...  C148        C
pasajero_nro_891         0       3  ...   NaN        Q

[891 rows x 11 columns]

In [32]:
data.loc[1]

Survived                          0
Pclass                            3
Name        Braund, Mr. Owen Harris
Sex                            male
Age                              22
SibSp                             1
Parch                             0
Ticket                    A/5 21171
Fare                           7.25
Cabin                           NaN
Embarked                          S
Name: 1, dtype: object

In [33]:
data.loc["1"]

KeyError: ignored

In [34]:
temp.loc[["pasajero_nro_1", "pasajero_nro_2", "pasajero_nro_3"], ["Name", "Sex"]]

                                                             Name     Sex
PassengerId
pasajero_nro_1                            Braund, Mr. Owen Harris    male
pasajero_nro_2  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
pasajero_nro_3                             Heikkinen, Miss. Laina  female

In [35]:
temp.iloc[[1, 2, 3], [2, 3]]

                                                             Name     Sex
PassengerId
pasajero_nro_2  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
pasajero_nro_3                             Heikkinen, Miss. Laina  female
pasajero_nro_4       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female

In [36]:
del temp

In [37]:
data.loc[:3, :"Sex"]

             Survived  ...     Sex
PassengerId            ...
1                   0  ...    male
2                   1  ...  female
3                   1  ...  female

[3 rows x 4 columns]

In [38]:
data.sort_values("Name").loc[:3]

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
846                 0       3  ...   NaN        S
747                 0       3  ...   NaN        S
280                 1       3  ...   NaN        S
309                 0       2  ...   NaN        C
875                 1       2  ...   NaN        C
...               ...     ...  ...   ...      ...
821                 1       1  ...   B69        S
275                 1       3  ...   NaN        Q
805                 1       3  ...   NaN        S
655                 0       3  ...   NaN        Q
3                   1       3  ...   NaN        S

[354 rows x 11 columns]

## Calculo de columnas nuevas

In [ ]:
temp = data[["Name"]].copy()
temp.OtroNombre = ["OTRO_" + n for n in data.Name]
temp

In [ ]:
temp.OtroNombre[:10]

In [ ]:
temp["OtroNombre"] = ["OTRO_" + n for n in data.Name]
temp

In [ ]:
del temp

## Filtrado

In [39]:
data["SibSp"] > 0

PassengerId
1       True
2       True
3      False
4       True
5      False
       ...
887    False
888    False
889     True
890    False
891    False
Name: SibSp, Length: 891, dtype: bool

In [40]:
data[data["Age"] > 18]

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S
...               ...     ...  ...   ...      ...
886                 0       3  ...   NaN        Q
887                 0       2  ...   NaN        S
888                 1       1  ...   B42        S
890                 1       1  ...  C148        C
891                 0       3  ...   NaN        Q

[575 rows x 11 columns]

In [51]:
data.select_dtypes("float")

              Age     Fare
PassengerId
1            22.0   7.2500
2            38.0  71.2833
3            26.0   7.9250
4            35.0  53.1000
5            35.0   8.0500
...           ...      ...
887          27.0  13.0000
888          19.0  30.0000
889           NaN  23.4500
890          26.0  30.0000
891          32.0   7.7500

[891 rows x 2 columns]

### Funciones comunes

Pandas ya viene con una cantidad de funciones incorporadas, por ejemplo:

* sum
* mean
* std
* var
* cumsum
* value_counts()

In [52]:
data.Age.mean()

29.69911764705882

In [53]:
data.mean()

Survived     0.383838
Pclass       2.308642
Age         29.699118
SibSp        0.523008
Parch        0.381594
Fare        32.204208
dtype: float64

In [54]:
data.sum()

Survived                                                  342
Pclass                                                   2057
Name        Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sex         malefemalefemalefemalemalemalemalemalefemalefe...
Age                                                   21205.2
SibSp                                                     466
Parch                                                     340
Ticket      A/5 21171PC 17599STON/O2. 31012821138033734503...
Fare                                                  28693.9
dtype: object

In [55]:
data.select_dtypes("float").sum(axis=1)

PassengerId
1       29.2500
2      109.2833
3       33.9250
4       88.1000
5       43.0500
         ...
887     40.0000
888     49.0000
889     23.4500
890     56.0000
891     39.7500
Length: 891, dtype: float64

In [56]:
data.Age.cumsum()

PassengerId
1         22.00
2         60.00
3         86.00
4        121.00
5        156.00
         ...
887    21128.17
888    21147.17
889         NaN
890    21173.17
891    21205.17
Name: Age, Length: 891, dtype: float64

In [57]:
data.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [58]:
data.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [49]:
data.Survived.value_counts(True)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

In [50]:
data.Survived.value_counts(1)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

### Ejercicio

1. Mostrar las primeras 16 files de data

In [ ]:
data.head(16)


2. ¿Cómo se llama el pasajero 881?

In [77]:
data.loc[[881], ["Name"]]

                                                     Name
PassengerId
881          Shelley, Mrs. William (Imanita Parrish Hall)


3. Calcular una columna numFam que sea la suma de la cantidad de familiares en el barco

In [80]:
data.SibSp.sum()

466


4. Encontrar la edad media de los sobrevivientes

In [105]:
data.Age.mean(["Survived"] == 1)

29.69911764705882